<template>
<div>
  <div class="map">
    <!-- 지도 영역 -->
  </div>
  <div class="map-remocon">
    <!-- 지도 애니메이션 컨트롤 -->
    <!-- 메인 색상, 시군구 별 % 설정, 각 %차오르는 애니메이션 효과 -->
  </div>
</div>
</template>
<script setup lang="ts">
/*
지도는 maplibre-gl를 사용한 영역을 구현한다.
현재 필요한 기능은 이미지 시안처럼 현대 느낌에 3D지도와 그 밑에 은은하게 깔리는 지도가 필요하다.

지도 이미지는 대한민국 시도 별로만 필요하다
서울특별시
부산광역시
대구광역시
인천광역시
광주광역시
대전광역시
울산광역시
세종특별자치시
경기도
강원특별자치도
충청북도
충청남도
전북특별자치도
전라남도
경상북도
경상남도
제주특별자치도
으로 총 17개로 중요한 점은 폴리곤과 배경 이미지가 맞아 떨어져야 한다는 것

3D 지도에 중요한 점은
0 ~ 99%와 100%에 확실한 차이가 있어야 한다는 점과 시군구 별 구분이 되야 한다는 것이다.
이를 위해 100% 일 때의 높이를 살짝 더 높이는 방식으로 진행한다. 단 애초에 0~100% 값에 의한 높이를 낮춘다.
너무 높게 하지 않는다.

폴리곤 생성을 위한 3D geojson 정보는 루트 디렉터리에 /data/geojson-raw 폴더에 korea-sgg.geojson을 참조하면 된다.
 */

</script>
